{
  "vocab_size": 50257,
  "hidden_size": 768,
  "intermediate_size": 2048,
  "moe_intermediate_size": 512,
  "num_hidden_layers": 12,
  "num_attention_heads": 12,
  "num_key_value_heads": 12,
  "n_shared_experts": 1,
  "n_routed_experts": 8,
  "routed_scaling_factor": 1.0,
  "kv_lora_rank": 64,
  "q_lora_rank": 192,
  "qk_rope_head_dim": 32,
  "qk_nope_head_dim": 32,
  "v_head_dim": 32,
  "q_head_dim": 64,
  "n_group": 2,
  "topk_group": 1,
  "num_experts_per_tok": 2,
  "first_k_dense_replace": 2,
  "moe_layer_freq": 1,
  "norm_topk_prob": true,
  "scoring_func": "sigmoid",
  "aux_loss_alpha": 0.001,
  "seq_aux": true,
  "max_position_embeddings": 2048,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-05,
  "use_cache": true,
  "rope_theta": 10000.0,
  "rope_parameters": {
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "rope_interleave": true,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "use_dsa": false,
  "dsa_top_k": 128,
  "dsa_n_indexer_heads": 4,
  "dsa_indexer_dim": 32,
  "dsa_start_layer": 0,
  "dsa_end_layer": null,
  "dsa_warmup_steps": 200,
  "dsa_sparse_steps": 400,
  "dsa_kl_loss_weight": 1.0,
  "transformers_version": "5.10.2",
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "problem_type": null,
  "_name_or_path": "",
  "pad_token_id": null,
  "bos_token_id": 50256,
  "eos_token_id": 50256,
  "tie_word_embeddings": true,
  "_comment": "DeepSeek V3.2 nano \u2014 ~166M params, GPT-2 vocab (50257). Designed for single/two-GPU real training on WikiText-2 or similar corpora. Architecture mirrors the paper's design at reduced scale.",
  "model_type": "deepseek_v3_2",
  "output_attentions": false
}